[
    {
        "description": "Index and brief description of topics in the Library. ",
        "pdf": "_TopicsIndex.pdf",
        "title": "INDEX TO TOPICS"
    },
    {
        "description": "Moses' older brother, the first high priest. According to the genealogical lists he was third in descent from Levi (Ex. 6:16-20; 1 Ch. 6:1-3). ",
        "pdf": "Aaron.pdf",
        "title": "Aaron"
    },
    {
        "description": "In Matthew 24:15-20, our Lord Himself spoke of the \"abomination of desolation\". ",
        "pdf": "Abomination.pdf",
        "title": "Abomination of Desolation"
    },
    {
        "description": "\"I will bless those who bless you, and whoever curses you I will curse; and all peoples on earth will be blessed through you.\" This is the beginning of the covenant with Abram. ",
        "pdf": "abrahamicCovenant.pdf",
        "title": "Abrahamic Covenant"
    },
    {
        "description": "David's third son by Maacah daughter of Talmai king of Geshur (a small country between Hermon and Bashan). ",
        "pdf": "Absalom.pdf",
        "title": "Absalom"
    },
    {
        "description": "chronology, and some of the political background of the Acts of the Apostles. ",
        "pdf": "actsHistoricalBackground.pdf",
        "title": "Acts, Historical Background"
    },
    {
        "description": "an introduction to the study of the Acts of the Apostles. ",
        "pdf": "aCTS_Intro.pdf",
        "title": "Acts, Introduction"
    },
    {
        "description": "outline of the book of Acts. ",
        "pdf": "actsOutline.pdf",
        "title": "Acts, Outline"
    },
    {
        "description": "a survey of the Acts of the Apostles. ",
        "pdf": "acts_Survey.pdf",
        "title": "Acts, Survey"
    },
    {
        "description": "It is fitting that we start with Adam, because Adam was the first head of the human race. By looking at Adam's life we can discover the beginnings of our problems... and solutions. ",
        "pdf": "adam.pdf",
        "title": "Adam"
    },
    {
        "description": "From Eph. 1:5, Gal. 4:5, etc., notes on the believer's spiritual adoption. ",
        "pdf": "adoption.pdf",
        "title": "Adoption"
    },
    {
        "description": "Christ, the Son, and the Holy Spirit are our advocates with the Father, protecting us against the lies of Satan. ",
        "pdf": "advocacy.pdf",
        "title": "Advocacy"
    },
    {
        "description": "The brotherly common meals of the early Church. ",
        "pdf": "AgapeFeast.pdf",
        "title": "The Agape Feast"
    },
    {
        "description": "Israelites learned farming during 400 years in Egypt. Description of farming practices and OT laws regulating them. ",
        "pdf": "agriculturePalestine.pdf",
        "title": "Agriculture in Palestine"
    },
    {
        "description": "City in Egypt founded by Alexander the Great. Birthplace of Apollos. Work site for the Septuagint version of the Old Testament. ",
        "pdf": "alexandria.pdf",
        "title": "Alexandria"
    },
    {
        "description": "Amalek was the son of Eliphaz and grandson of Esau (Gen. 36:12, 16), and as a collective noun, the Amelekites, were his descendants. ",
        "pdf": "Amalekites.pdf",
        "title": "Amalekites"
    },
    {
        "description": "Now then, we are ambassadors for Christ. ",
        "pdf": "ambassadorship.pdf",
        "title": "Ambassadorship"
    },
    {
        "description": "The name Amorite is used in the OT to denote (1) the inhabitants of Palestine generally, (2) the population of the hills as opposed to the plain, and (3) a specific people under a king of their own. ",
        "pdf": "Amorites.pdf",
        "title": "Amorites"
    },
    {
        "description": "A prophet of the 8th cent B.C., and the third book of the Minor Prophets. ",
        "pdf": "Amos.pdf",
        "title": "Amos"
    },
    {
        "description": "by Xenophon, The March of the Ten Thousand. The most famous work of the Greek professional soldier and writer Xenophon. The journey it narrates is his best known accomplishment and \"one of the great adventures in human history.\" ",
        "pdf": "aNABASIS.pdf",
        "title": "Anabasis"
    },
    {
        "description": "a categorial study of the Doctrine of Angels. ",
        "pdf": "angels.pdf",
        "title": "Angels"
    },
    {
        "description": "What the Bible says about anger, ours and God's. How to deal with sinful anger. ",
        "pdf": "anger.pdf",
        "title": "Anger"
    },
    {
        "description": "In the Church Age, antichrist refers to any believer who resides and functions in the world system of Satan. ",
        "pdf": "antichrist.pdf",
        "title": "Antichrist"
    },
    {
        "description": "Antinomianism is the view that Christians are exempt from the demands of the moral law by reason of their reliance upon divine grace alone for salvation. ",
        "pdf": "Antinomianism.pdf",
        "title": "Antinomianism"
    },
    {
        "description": "where followers of Christ were first called Christians, is located some three hundred miles north of Jerusalem, on the west bank of the Orontes River. ",
        "pdf": "antioch.pdf",
        "title": "Antioch"
    },
    {
        "description": "The word Apocrypha means \"hidden\", or \"secret\". The term \"Apocrypha\" is usually applied to a collection of books, from eleven to sixteen in number, which appeared during the interim between the Old and New Testaments. These books have come down to us in more or less close connection with the canonical books of the Bible. ",
        "pdf": "Apocrypha.pdf",
        "title": "Apocrypha and non-Canonical WritingsApocrypha"
    },
    {
        "description": "a short account of what the Bible has to say about this friend of the apostle Paul. ",
        "pdf": "apollos.pdf",
        "title": "Apollos"
    },
    {
        "description": "Qualifications, credentials, and function of apostles. ",
        "pdf": "apostleship.pdf",
        "title": "Apostleship"
    },
    {
        "description": "The apostolic period extends from the Day of Pentecost to the death of St. John, and covers about seventy years, from AD 30 to 100. ",
        "pdf": "apostolicAge.pdf",
        "title": "Apostolic Age, The"
    },
    {
        "description": "The beginnings of the Church in the times of the Apostles. ",
        "pdf": "apostolicChurch.pdf",
        "title": "Apostolic Church, The"
    },
    {
        "description": "at least a partial listing, including brief biographies of the successors to the Apostles. ",
        "pdf": "ApostolicFathers.pdf",
        "title": "Apostolic Fathers, The"
    },
    {
        "description": "Two friends of Paul whom he met in Corinth, who traveled to Ephesus with him, and were instructors of Apollos. ",
        "pdf": "aquila.pdf",
        "title": "Aquila and Priscilla"
    },
    {
        "description": "Aramaic is a language or group of languages of the Semitic family, closely related to Hebrew. Biblical Aramaic, formerly called Chaldee, is the name given to the Aramaic occasionally found in the Old Testament. ",
        "pdf": "AramaicLanguage.pdf",
        "title": "The Aramaic Language"
    },
    {
        "description": "The Areopagus is a hill northwest of the Acropolis in Athens, Greece, where the apostle Paul preached to the intellectuals. ",
        "pdf": "Areopagus.pdf",
        "title": "Areopagus"
    },
    {
        "description": "The Ark of the Tabernacle, its history and typology. ",
        "pdf": "arkOfTheCovenant.pdf",
        "title": "Ark of the Covenant"
    },
    {
        "description": "a review of the final battle. ",
        "pdf": "armageddon.pdf",
        "title": "Armageddon"
    },
    {
        "description": "An exposition of Eph. 6:10-17; a discussion of demon organization and tactics; history of Roman armor to explain vocabulary. ",
        "pdf": "armorOfGod.pdf",
        "title": "Armor of God"
    },
    {
        "description": "\"If training in arms ceases, there is no difference between a soldier and a civilian! and No matter how many years he has served, an unexercised solder is a raw recruit!\" - Vegetius ",
        "pdf": "ArmorOfGod_Using.pdf",
        "title": "Armor of God, Using"
    },
    {
        "description": "Scripture passages related to the ascension of the Lord Jesus Christ. ",
        "pdf": "ascension.pdf",
        "title": "Ascension of Christ"
    },
    {
        "description": "The land to which this name has been applied plays an important part in some periods of Bible history, and a central part in the history of the earliest Christian mission. ",
        "pdf": "AsiaMinor.pdf",
        "title": "Asia Minor"
    },
    {
        "description": "Capsule history of the Assyrian Empire. ",
        "pdf": "assyria.pdf",
        "title": "Assyria"
    },
    {
        "description": "a thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "assyria(rawlinson).pdf",
        "title": "Assyria (Rawlinson)"
    },
    {
        "description": "one of the greatest cultural centers of Paul’s day, grew up around a 520-foot-high rocky plateau called the Acropolis. ",
        "pdf": "athens.pdf",
        "title": "Athens"
    },
    {
        "description": "The Day of Atonement was the fourth of the five annual feasts of pre-exile Israel. ",
        "pdf": "AtonementDayOf.pdf",
        "title": "Atonement, The Day of"
    },
    {
        "description": "a brief biography of the Roman Emperor who sent out the decree at the time of Jesus' birth that \"all the world\" should be taxed. ",
        "pdf": "Augustus.pdf",
        "title": "Augustus"
    },
    {
        "description": "Authority of God as delegated to the apostles, and from the apostles to us via the Scriptures; proper responses to civil, ecclesiastical, and family authority. ",
        "pdf": "authority.pdf",
        "title": "Authority, God's Chain of Command"
    },
    {
        "description": "The supreme fertility-god of the Canaanites. ",
        "pdf": "Baal.pdf",
        "title": "Baal"
    },
    {
        "description": "The popular designation of the tower (Heb mig?d?l) described in Gen. 11, which people migrating from the East built in the midst of their city in the plain of Shinar. ",
        "pdf": "Babel.pdf",
        "title": "Babel, Tower of"
    },
    {
        "description": "Babylon lay on the bank of the Euphrates in the land of Shinar (Gen. 10:10), in the northern area of Babylonia (now southern Iraq) called Accad (as opposed to the southern area called Sumer). ",
        "pdf": "Babylon.pdf",
        "title": "Babylon"
    },
    {
        "description": "detailed ancient history of the Babylonian empire, by George Rawlinson, MA. ",
        "pdf": "Babylonia(Rawlinson).pdf",
        "title": "Babylonia"
    },
    {
        "description": "Short description of Balaam's career with reference to the Doctrine of Balaam ",
        "pdf": "Balaam.pdf",
        "title": "Balaam"
    },
    {
        "description": "The seven types of baptism in the Bible; the baptism of the Holy Spirit; believer's baptism. ",
        "pdf": "Baptism.pdf",
        "title": "Baptism"
    },
    {
        "description": "The Acts of the Apostles describes Barnabas as 'a good man, full of the Holy Spirit and of faith' (Acts 6:24). ",
        "pdf": "Barnabas.pdf",
        "title": "Barnabas"
    },
    {
        "description": "The doctrines of Reconciliation, Propitiation, and the removal of the barrier between God and man. ",
        "pdf": "Barrier.pdf",
        "title": "The Barrier, Reconciliation, Justification"
    },
    {
        "description": "The eight blessings in the Beatitudes, related to the Christian life. ",
        "pdf": "Beatitudes.pdf",
        "title": "Beatitudes"
    },
    {
        "description": "The name of this venerable town means literally \"the well of seven.\" {MAR 2013] ",
        "pdf": "BeerSheba.pdf",
        "title": "Beer-Sheba"
    },
    {
        "description": "The youngest of Jacob's sons, the only one to be born in Palestine; and the tribe named for him. The tribe of the Apostle Paul. ",
        "pdf": "Benjamin.pdf",
        "title": "Benjamin"
    },
    {
        "description": "When they were driven out of Thessalonica, Paul and Silas came to Berea, where they preached in the synagogue of the Jews. ",
        "pdf": "Berea.pdf",
        "title": "Berea"
    },
    {
        "description": "the sister of Herod Agrippa II; features in trial of Paul in Acts 25. ",
        "pdf": "Berenice.pdf",
        "title": "Berenice"
    },
    {
        "description": "The home of Ruth and Boaz, the city of David, the birthplace of Jesus Christ. ",
        "pdf": "Bethlehem.pdf",
        "title": "Bethlehem-Judah"
    },
    {
        "description": "a Bible teacher's study notes must be converted into exposition which can be understood by his audience. ",
        "pdf": "BibleExegesisAndExposition.pdf",
        "title": "Bible Exegesis and Exposition"
    },
    {
        "description": "by Drue Freeman. How to study the Bible with understanding. ",
        "pdf": "BibleStudy.pdf",
        "title": "Bible Study"
    },
    {
        "description": "Bithynia was a Roman province in the northwest corner of Asia Minor. 1 Peter 1:1. ",
        "pdf": "Bithynia.pdf",
        "title": "Bithynia"
    },
    {
        "description": "Bitterness is one of the most crushing mental problems in a person's life; the Bible has solutions. ",
        "pdf": "Bitterness.pdf",
        "title": "Bitterness"
    },
    {
        "description": "Bible origins of the New Testament word \"blessing\", applications. ",
        "pdf": "Blessing.pdf",
        "title": "Blessing"
    },
    {
        "description": "Teaching on the representative analogy which the Blood of Christ forms with the death of the animal on the altar. ",
        "pdf": "BloodOfChrist.pdf",
        "title": "Blood of Christ"
    },
    {
        "description": "Every Christian is a member of the Body of Christ. ",
        "pdf": "BodyOfChrist.pdf",
        "title": "Body of Christ"
    },
    {
        "description": "the life of the great Christian author of Pilgrim's Progress. ",
        "pdf": "BunyanJohnLife.pdf",
        "title": "Bunyan, John"
    },
    {
        "description": "A busybody is a person who inserts himself uninvited into some else’s life, who meddles or pries into the affairs of others. The Bible is very clear that this is wrong, totally inappropriate behavior, especially in a local church congregation. ",
        "pdf": "Busybody.pdf",
        "title": "Busybody"
    },
    {
        "description": "Canaan is an ancient name for the area that includes all of the land west of the Jordan and Syria to the level of Lebweh. ",
        "pdf": "Canaan.pdf",
        "title": "Canaan"
    },
    {
        "description": "The most important city on the northern shore of the Sea of Galilee. It was here that Jesus established His headquarters for the major part of His public ministry (Mt. 4:13). ",
        "pdf": "Capernaum.pdf",
        "title": "Capernaum"
    },
    {
        "description": "Caesarea, the Roman capital of Judea in the time of Christ and Paul, was located by the sea, thirty-two miles north of Joppa, and some sixty miles northwest of Jerusalem. ",
        "pdf": "CaesareaPalestine.pdf",
        "title": "Caesarea Palestine"
    },
    {
        "description": "Caesarea Philippi was located at the foot of Mt. Hermon ... one of the most beautiful localities in all the Holy Land. ",
        "pdf": "CaesareaPhilippi.pdf",
        "title": "Caesarea Philippi"
    },
    {
        "description": "A description of the battle for this ancient capital of the Hittite empire, with Bible references ",
        "pdf": "Carchemish.pdf",
        "title": "Carchemish, Battle of"
    },
    {
        "description": "the history of the ancient kingdom where Abraham was born and which later was the locale of the Babylonian empire. ",
        "pdf": "Chaldea.pdf",
        "title": "Chaldea"
    },
    {
        "description": "a thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "chaldea(rawlinson).pdf",
        "title": "Chaldea - Rawlinson"
    },
    {
        "description": "a title for each chapter in the Bible. ",
        "pdf": "ChapterTitles_Bible.pdf",
        "title": "Chapter Titles"
    },
    {
        "description": "Whom the Lord loves, He chastens; the study of Divine Discipline ",
        "pdf": "Chastisement.pdf",
        "title": "Chastisement (Divine Discipline)"
    },
    {
        "description": "Some ideas regarding setting Biblical goals for nurturing and training children in the plan of God. ",
        "pdf": "ChildrenGoals.pdf",
        "title": "Children, Goals for"
    },
    {
        "description": "mentioned on Paul’s third missionary journey. Chios was especially noted in antiquity for its claim to be the birthplace of Homer, for its school of epic poets, and its sculptors. ",
        "pdf": "Chios.pdf",
        "title": "Chios -"
    },
    {
        "description": "This is the stone which was set at nought of you builders, which is become the head of the corner. ",
        "pdf": "ChristTheRock.pdf",
        "title": "Christ the Rock"
    },
    {
        "description": "Suggestions for a believer's attitude and function on the job. ",
        "pdf": "ChristianAtWork.pdf",
        "title": "Christian at Work"
    },
    {
        "description": " Christian Worker Qualifications - [PDF] Biblical qualifications for Christians in the Lord's service. ",
        "pdf": "WorkerQuals.pdf",
        "title": "Christian Worker Qualifications"
    },
    {
        "description": "A description of the life of Christians in the early church, as found in the Epistle to Diognetus, by an unknown author of the 2nd Century. ",
        "pdf": "christiansearlychurch.pdf",
        "title": "Christians of the Early Church"
    },
    {
        "description": " Chronology of New Testament Times - [PDF] ",
        "pdf": "ChronologyNewTestament.pdf",
        "title": "Chronology of New Testament Times"
    },
    {
        "description": " Chronology of the World from the Christian perspective - [PDF] ",
        "pdf": "",
        "title": "Chronology of the World from the Christian perspective"
    },
    {
        "description": "Many people think of church in terms of brick and mortar, program and form. But in these passages you will learn that the Church is a spiritual organism, dear to the heart of God the Father. ",
        "pdf": "Church.pdf",
        "title": "Church, the Body of Christ"
    },
    {
        "description": "The importance of the doctrine of Circumcision in Church Age teaching. ",
        "pdf": "Circumcision.pdf",
        "title": "Circumcision"
    },
    {
        "description": "Verses describing the Christian's transfer of citizenship from the world to the heavenly kingdom through union with Christ. ",
        "pdf": "Citizenship.pdf",
        "title": "Citizenship of the Believer"
    },
    {
        "description": "Tiberius Claudius Drusus Caesar, the fourth Roman Emperor (40 to 54 AD). ",
        "pdf": "Claudius.pdf",
        "title": "Claudius"
    },
    {
        "description": "overview of the city of the Colossians. ",
        "pdf": "colossae.pdf",
        "title": "Colossae"
    },
    {
        "description": "the Lord's Supper; derivation from the Passover ",
        "pdf": "Communion.pdf",
        "title": "Communion"
    },
    {
        "description": "The principles of biblical confession of sin; how the Lord's grace provision makes it possible for a Christian to stay in fellowship. ",
        "pdf": "Confession.pdf",
        "title": "Confession of Sin"
    },
    {
        "description": "Coos is an island mentioned in connection with Paul’s third missionary journey in Acts 21:1, and in its relations with the Jews in 1 Macc. 15:23; Josephus Ant. xiv.7.2; 10.15. ",
        "pdf": "Coos(Cos).pdf",
        "title": "Coos (Cos)"
    },
    {
        "description": "A brief summary of the history of the Greek city where Paul stayed 18 months. ",
        "pdf": "Corinth.pdf",
        "title": "Corinth"
    },
    {
        "description": "A Roman centurion converted by Peter after both had seen divine visions (Acts 10:1–11:18), the first Gentile known to become a Christian. ",
        "pdf": "cornelius.pdf",
        "title": "Cornelius"
    },
    {
        "description": "Satan's plan and process for controlling the world, and his attempt, using his organization of fallen angels, to counteract the plan of God in all respects. ",
        "pdf": "CosmicSystem.pdf",
        "title": "Cosmic System"
    },
    {
        "description": "An extensive study of God's Covenants with Adam, Noah, Abraham, Moses, David; and the New Covenant. ",
        "pdf": "Covenants.pdf",
        "title": "Covenants"
    },
    {
        "description": "An outline history of Crete and historical comments on the character of the people; a historical supplement to the study of the Epistle to Titus ",
        "pdf": "Crete.pdf",
        "title": "Crete, Brief History"
    },
    {
        "description": "An island situated near the northeast corner of the Mediterranean Sea, in angle formed by the coasts of Cilicia (modern Turkey) and Syria. ",
        "pdf": "cyprus.pdf",
        "title": "Cyprus"
    },
    {
        "description": "Properly Cyrus II, the Great, founder of the Persian empire. He reigned from 559 to 530 B.C., and his empire flourished until its conquest by Alexander the Great (331 B.C.). ",
        "pdf": "CyrusTheGreat.pdf",
        "title": "Cyrus the Great"
    },
    {
        "description": "This is a daily Bible reading listing for the year 2012. With this arrangement, you read the whole Bible in a year, but in the chronological order of events. So, for example, many of the Psalms are included with the readings for historical books, because they were written at the time of those events. Likewise, the writings of prophets are included with contemporary historical events. ",
        "pdf": "DailyBibleReading.pdf",
        "title": "Daily Bible Reading"
    },
    {
        "description": "an outline study of this oldest city in the world; of central interest to Bible events. ",
        "pdf": "damascus.pdf",
        "title": "Damascus"
    },
    {
        "description": "description of the various roads which Saul could have used to travel between Jerusalem and Damascus. ",
        "pdf": "DamascusRoads.pdf",
        "title": "Damascus, Roads to"
    },
    {
        "description": "an exposition of Ephesians 4:17-24. ",
        "pdf": "DarknessOfTheSoul.pdf",
        "title": "Darkness in the Soul"
    },
    {
        "description": "an exposition of Leviticus 16; Keil and Delitzsch ",
        "pdf": "DayOfAtonement.pdf",
        "title": "Day of Atonement"
    },
    {
        "description": "a Greek word study (Kittel) on diakonos ",
        "pdf": "Deacons_WordStudy.pdf",
        "title": "Deaconsdiakonos"
    },
    {
        "description": "The name generally given to the manuscripts and fragments of manuscripts of the Bible discovered in caves near the northwestern end of the Dead Sea in the period between 1946 and 1956. ",
        "pdf": "DeadSeaScrolls.pdf",
        "title": "Dead Sea Scrolls"
    },
    {
        "description": "Seven types of death in the Bible. ",
        "pdf": "Death.pdf",
        "title": "Death, Seven Types"
    },
    {
        "description": "The death of Jesus Christ was an act of obedience to God the Father's plan of salvation. ",
        "pdf": "deathofchrist.pdf",
        "title": "Death of Christ"
    },
    {
        "description": "a fresh oppression of the Israelites, and the glorious victory which they obtained over Sisera, Jabin's general, through the judge Deborah and the heroic warrior Barak. ",
        "pdf": "DeborahAndBarak.pdf",
        "title": "Deborah and Barak"
    },
    {
        "description": "Scripture references to the deity of Christ in which divine essence is attributed to Christ. ",
        "pdf": "deityofchrist.pdf",
        "title": "Deity of Christ"
    },
    {
        "description": "Outline of Bible references to demons; descriptions of identity and functions ",
        "pdf": "Demons.pdf",
        "title": "Demons, Intro. to Study of"
    },
    {
        "description": "A discussion of the problem of depression - Bible's advice. ",
        "pdf": "Depression.pdf",
        "title": "Depression - Bible Solutions"
    },
    {
        "description": "The book of Deuteronomy contains not so much \"a recapitulation of the things commanded and done, as related in Exodus, Leviticus, and Numbers\" (Theod.), as \"a compendium and summary of the whole law and wisdom of the people of Israel, wherein those things which related to the priests and Levites are omitted, and only such things included as the people generally required to know\" (Luther). ",
        "pdf": "Deuteronomy_Introduction.pdf",
        "title": "Deuteronomy - Introduction"
    },
    {
        "description": "biographies of the twelve and other disciples. ",
        "pdf": "Disciples.pdf",
        "title": "Disciples, Christ's"
    },
    {
        "description": "A dispensation is a period of time which is identified by its relation to some particular purpose of God. ",
        "pdf": "Dispensations.pdf",
        "title": "Dispensations"
    },
    {
        "description": "The term used to designate the Jews living outside Palestine and maintaining their religious observances and customs among the Gentiles. ",
        "pdf": "Dispersion.pdf",
        "title": "Dispersion"
    },
    {
        "description": "The classic definition comes from R.B. Thieme, Jr.: “The decree of God is His eternal (always existed), holy (perfect integrity), wise (the application of omniscience to creation), and sovereign purpose, comprehending simultaneously all things that ever were or will be in their causes, conditions (status), successions (interaction with others that leads to certain decisions), relations, and determining their certain futurition.” ",
        "pdf": "DivineDecree.pdf",
        "title": "Divine Decrees"
    },
    {
        "description": " Divine Discipline, Five Cycles - [PDF] Jehovah chastens nations which are out of fellowship. ",
        "pdf": "FiveCycles.pdf",
        "title": "Divine Discipline, Five Cycles -Divine Discipline, Five Cycles"
    },
    {
        "description": "The divine guidance of Christ; divine guidance for the Christian believer. ",
        "pdf": "DivineGuidance.pdf",
        "title": "Divine Guidance"
    },
    {
        "description": "divisions and heresies in the Church in the time of the apostle Paul. ",
        "pdf": "DivisionsintheEarlyChurch.pdf",
        "title": "Divisions in the Early Church"
    },
    {
        "description": "The believer must give the highest priority in life to learning Bible facts and principles, and applying them to every situation. ",
        "pdf": "ImportanceOfDoctrine.pdf",
        "title": "Doctrine, The Importance of"
    },
    {
        "description": "A test of basic doctrinal knowledge - test your own progress in Bible academics. ",
        "pdf": "doctrinetest.pdf",
        "title": "Doctrine Test"
    },
    {
        "description": "The doctrine of Doubtful Things refers to those issues that are not directly dealt with in the Scriptures. It is primarily related to the believer's attitude toward the weaker Christian. ",
        "pdf": "DoubtfulThings.pdf",
        "title": "Doubtful Things"
    },
    {
        "description": "Details of the organization and activities of the Church, from Pentecost to the beginning of Paul's ministry. ",
        "pdf": "EarlyChurch.pdf",
        "title": "Early Church"
    },
    {
        "description": "A Jewish-Christian heretical sect flourishing in the 2nd, 3rd, and 4th cents A.D. ",
        "pdf": "Ebionites.pdf",
        "title": "Ebionites"
    },
    {
        "description": "the doctrine of growing in the knowledge of Jesus Christ, leading to productivity in the Christian way of life. ",
        "pdf": "Edification.pdf",
        "title": "Edification"
    },
    {
        "description": "Historical summary of the Edomites. ",
        "pdf": "Edomites.pdf",
        "title": "Edomites"
    },
    {
        "description": "Among Herodotus' descriptions of countries the most fascinating to the modern reader, as it was to the ancient, is his account of the marvels of the land of Egypt. ",
        "pdf": "Egypt.Herodotus.pdf",
        "title": "Egypt - Herodotus"
    },
    {
        "description": "a thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "egypt(rawlinson).pdf",
        "title": "Egypt - Rawlinson"
    },
    {
        "description": "A review of all the happenings and activities which accompany the end times. ",
        "pdf": "EndTimeEvents.pdf",
        "title": "End Time Events"
    },
    {
        "description": "Every Christian has a duty to love his enemies and to witness to them. ",
        "pdf": "Enemies.pdf",
        "title": "Enemies, Witnessing to"
    },
    {
        "description": " English Language, Origins of the - [PDF] ",
        "pdf": "English.pdf",
        "title": "English Language, Origins of the"
    },
    {
        "description": "the man who \"was not, because God took him.\" ",
        "pdf": "Enoch.pdf",
        "title": "Enoch"
    },
    {
        "description": "overview of the city of the Ephesians. ",
        "pdf": "Ephesus.pdf",
        "title": "Ephesus"
    },
    {
        "description": "Epicurus and his followers devoted themselves primarily to the pursuit of personal, individual happiness. ",
        "pdf": "Epicureans.pdf",
        "title": "Epicureans"
    },
    {
        "description": "many scripture verses describing all of the characteristics of the personality of God. ",
        "pdf": "essence.pdf",
        "title": "Essence of God"
    },
    {
        "description": "A description of the ascetic religious sect of the Essenes, the forerunner of the monastic orders. ",
        "pdf": "Essenes.pdf",
        "title": "Essenes"
    },
    {
        "description": "Three stages of everlasting life, \"now\" and \"forever\". ",
        "pdf": "EternalLife.pdf",
        "title": "Eternal Life"
    },
    {
        "description": "An understanding of these concepts is required before there can be stability in our Christian lives. ",
        "pdf": "EternalSecurity.pdf",
        "title": "Eternal Security"
    },
    {
        "description": "We don’t know much in detail about eternity, what it’s like, or what we will be doing there. However, the Bible does have some information from which we can draw some inferences. ",
        "pdf": "Eternity.pdf",
        "title": "Eternity"
    },
    {
        "description": "The history of the relationship between the Passover and the Lord's Supper. ",
        "pdf": "Eucharist.pdf",
        "title": "Eucharist"
    },
    {
        "description": "A thorough study of the doctrines related to Satan's strategy, his attempt to discredit the Lord Jesus Christ during the Church Age. ",
        "pdf": "Evil.pdf",
        "title": "Evil, Doctrine of"
    },
    {
        "description": "Christians are commanded to \"exhort\" one another. Sometimes that calls for a comforting ministry, and sometimes it calls for straight talk. ",
        "pdf": "Exhortation.pdf",
        "title": "Exhortation"
    },
    {
        "description": "Exorcisms are acts of liberating afflicted persons from the influence of demons. ",
        "pdf": "Exorcism.pdf",
        "title": "Exorcism"
    },
    {
        "description": "Ezra returned to Jerusalem with a group of repatriates and others in the seventh year of Artaxerxes. ",
        "pdf": "Ezra.pdf",
        "title": "Ezra"
    },
    {
        "description": "Faith as a means of learning compared to rationalism and empiricism; how Christian faith works; how to grow in faith. ",
        "pdf": "Faith.pdf",
        "title": "Faith"
    },
    {
        "description": " Faith-Rest - [PDF] The practice of enjoying the peace of God. How to claim promises; how to be stable and relaxed; how to enjoy happiness that doesn't depend on people, circumstances or things. ",
        "pdf": "FaithRest.pdf",
        "title": "Faith-Rest"
    },
    {
        "description": "applying Faith-Rest. ",
        "pdf": "Faith_Rest_and_Stability.pdf",
        "title": "Faith-Rest and Stability"
    },
    {
        "description": " Faithfulness of God - [PDF] The faithfulness of God to the believer is expressed in many ways in the Bible. ",
        "pdf": "FaithfulnessOfGod.pdf",
        "title": "Faithfulness of God"
    },
    {
        "description": " False Prophet, The- [PDF] The False Prophet of the end times. ",
        "pdf": "FalseProphet.pdf",
        "title": "False Prophet, The"
    },
    {
        "description": " Felix Antonius- [PDF] A Roman procurator of Judea, appointed by the emperor Claudius. Dealt with Paul in Caesarea. [AUG 2014] ",
        "pdf": "felix.pdf",
        "title": "Felix Antonius"
    },
    {
        "description": " Fellowship, Christian - [PDF] Four areas of relationship [koinonia] for believers in a local church: doctrine, fellowship, breaking of bread, prayer. ",
        "pdf": "Fellowship.pdf",
        "title": "Fellowship, Christian"
    },
    {
        "description": " Festus- [PDF] The Roman governor or procurator who succeeded FELIX ANTONIUS in the province of Judea (Acts 24:27). [AUG 2014] ",
        "pdf": "festus.pdf",
        "title": "Festus"
    },
    {
        "description": " Forgiveness - [PDF] The test of Grace living is a forgiving spirit. ",
        "pdf": "Forgiveness.pdf",
        "title": "Forgiveness"
    },
    {
        "description": " Four Gospels, The - [PDF] An introduction to the gospels of Matthew, Mark, Luke and John. ",
        "pdf": "FourGospels.pdf",
        "title": "Four Gospels, The"
    },
    {
        "description": " Freedom - [PDF] What it means to be set free from \"the law of sin and death.\" ",
        "pdf": "Freedom.pdf",
        "title": "Freedom"
    },
    {
        "description": " Friendships - [PDF] Every meeting with another person is a divine encounter. ",
        "pdf": "Friendships.pdf",
        "title": "Friendships"
    },
    {
        "description": "Gabriel is a celestial being or personage who is mentioned by name only four times in Scripture. ",
        "pdf": "gabriel.pdf",
        "title": "Gabriel"
    },
    {
        "description": "the location of much of Paul's travels; occupied by Gauls from Europe. ",
        "pdf": "Galatia.pdf",
        "title": "Galatia"
    },
    {
        "description": "The northern portion of Palestine, scene of most of the earthly ministry of Jesus. ",
        "pdf": "galilee.pdf",
        "title": "Galilee"
    },
    {
        "description": "The most common name in the Gospels for that lake where so much of Jesus’ ministry took place, taken from the district in which it was located. ",
        "pdf": "galilee-sea.pdf",
        "title": "Galilee, Sea of"
    },
    {
        "description": "The great Talmudic scholar of the 1st Century; and the teacher in Judaism of the Apostle Paul. ",
        "pdf": "gamaliel.pdf",
        "title": "Gamaliel"
    },
    {
        "description": "from Guizot's History of France. ",
        "pdf": "Gaul_Christianity_In(Guizot).pdf",
        "title": "Gaul, Christianity in"
    },
    {
        "description": "from Guizot's History of France; the Galatians were Gauls from Europe. ",
        "pdf": "Gauls_of_Galatia(Guizot).pdf",
        "title": "Gauls of Galatia"
    },
    {
        "description": " Genealogy of Jesus Christ - [PDF] the complete listing of all the forbears of Jesus, from Adam to Joseph and Mary. ",
        "pdf": "Genealogy.pdf",
        "title": "Genealogy of Jesus Christ"
    },
    {
        "description": " Gideon - [PDF] A brief history of the life of Gideon, the judge of Israel. ",
        "pdf": "Gideon.pdf",
        "title": "Gideon"
    },
    {
        "description": " Giving - [PDF] A brief study of Christian giving - comments on 2 Corinthians 8 and 9. ",
        "pdf": "Giving.pdf",
        "title": "Giving"
    },
    {
        "description": " Glory of God - [PDF] Word study of the word \"glory\" as it refers to the nature of God.\\ ",
        "pdf": "GloryOfGod.pdf",
        "title": "Glory of God"
    },
    {
        "description": " Gnosticism and the Colossian Heresy> - [PDF] ",
        "pdf": "Gnosticism(ColossianHeresy).pdf",
        "title": "Gnosticism and the Colossian Heresy"
    },
    {
        "description": " Godliness - [PDF] The study of the Greek Word eusebeia, \"inner piety\", spiritual maturity in believers. ",
        "pdf": "Godliness.pdf",
        "title": "Godliness"
    },
    {
        "description": " Golden Calf, The - [PDF] The golden calf represents the failure of the children of Israel at the Holy Mountain of God. ",
        "pdf": "GoldenCalf.pdf",
        "title": "Golden Calf, The"
    },
    {
        "description": " Gospel, The - [PDF] The use of the term \"gospel\" in the New Testament - the \"good news\" of salvation. ",
        "pdf": "Gospel.pdf",
        "title": "Gospel, The"
    },
    {
        "description": " Gossip - [PDF] In its biblical setting, \"gossip\" is used to designate the spreading of secrets or rumors, usually for the purpose of slander. [MAR 2013] ",
        "pdf": "Gossip.pdf",
        "title": "Gossip"
    },
    {
        "description": " Grace - [PDF] A thorough treatment of the most important doctrine of the Christian life. The work of God and the Plan of God are completely based on Grace. ",
        "pdf": "Grace.pdf",
        "title": "Grace"
    },
    {
        "description": " Grace Provision - [PDF] God the Father provides logistical supply for believers. ",
        "pdf": "GraceProvision.pdf",
        "title": "Grace Provision"
    },
    {
        "description": "a short history of ancient Greece (24 pages). ",
        "pdf": "GreekHistory.pdf",
        "title": "Greek History"
    },
    {
        "description": " Hannah's Song of Praise - [PDF] The prayer in which Hannah poured out the feelings of her heart, after the dedication of her son to the Lord, is a song of praise of a prophetic and Messianic character. [MAR 2013] ",
        "pdf": "HannahsSongOfPraise.pdf",
        "title": "Hannah's Song of Praise"
    },
    {
        "description": " Hannibal - [PDF] When Hannibal was twenty-eight years old he had received a soldier's training through nineteen years in camp. He had disciplined his body to hardship, his appetite to moderation, his tongue to silence, his thought to objectivity. [MAR 2013] ",
        "pdf": "Hannibal.pdf",
        "title": "Hannibal"
    },
    {
        "description": " Happiness - [PDF] The joy of God; a happiness that does not depend on people, things, or circumstances. ",
        "pdf": "Happiness.pdf",
        "title": "Happiness"
    },
    {
        "description": "a stopping point on Abraham's journey to Canaan. ",
        "pdf": "Haran.pdf",
        "title": "Haran"
    },
    {
        "description": "this is a table showing the correlation between events in the four gospels. ",
        "pdf": "HarmonyoftheGospels.pdf",
        "title": "Harmony of the Gospels"
    },
    {
        "description": " Heaven - [PDF] The word heaven, or the heavens, is used in the Scriptures in a number of different senses. [FEB 13] ",
        "pdf": "Heaven.pdf",
        "title": "Heaven"
    },
    {
        "description": " Heavenlies, The - [PDF] Brief notes on the locations known as the heavenlies or heavenly places. ",
        "pdf": "Heavenlies.pdf",
        "title": "Heavenlies, The"
    },
    {
        "description": "a short study of the Greek thinking that influenced the thinking and culture of those Jewish people who were educated in Greek philosophy and culture. ",
        "pdf": "Hellenism.pdf",
        "title": "Hellenism"
    },
    {
        "description": "the differences between traditional Judaism and the \"modern\" Greek culture of the 1st century, affected even the early Christian congregations (Acts 6:1 ff). ",
        "pdf": "HellenistsArameans.pdf",
        "title": "Hellenists and Arameans"
    },
    {
        "description": " Heresy and Apostasy - [PDF] Definitions, and the Biblical solution to the problem of apostasy in the local church. ",
        "pdf": "Heresy.pdf",
        "title": "Heresy and Apostasy"
    },
    {
        "description": " Hermeneutics - [PDF] The science and art of Biblical interpretation, by Pastor Drue Freeman. ",
        "pdf": "Hermeneutics.pdf",
        "title": "Hermeneutics"
    },
    {
        "description": "A classical study in Hermeneutics, by Rollin Thomas Chafer. Used in Pastor's Ministry Workshop of Austin Bible Church ",
        "pdf": "Hermeneutics_Chafer.pdf",
        "title": "Hermeneutics, Syllabus of Studies in"
    },
    {
        "description": "The Herod mentioned in Matthew 2 and in Luke 1, is known to history as Herod the Great. His family was Jewish, by race, but the were actually Idumeans (Edomites). ",
        "pdf": "herod.pdf",
        "title": "Herod, The Family of"
    },
    {
        "description": "He was the son of the first and better-known Herod Agrippa, the brother of Berenice, Mariamne, and Drusilla (second wife of the Roman procurator Antonius Felix). Conducted trial of Paul in Caesarea. ",
        "pdf": "herodagrippa2.pdf",
        "title": "Herod Agrippa II"
    },
    {
        "description": "“These are the researches of Herodotus of Halicarnassus, which he publishes, in the hope of thereby preserving from decay the remembrance of what men have done, and of preventing the great and wonderful actions of the Greeks and the Barbarians from losing their due share of glory.” ",
        "pdf": "Herodotus_History.pdf",
        "title": "Herodotus - The History"
    },
    {
        "description": "An eminent Jewish scholar and rabbinic leader in Jerusalem in the early Herodian period. Contemporary with Gamilel. ",
        "pdf": "Hillel.pdf",
        "title": "Hillel"
    },
    {
        "description": "The Hittites are a Hamitic people. They are the descendants of Heth, Gen 10:15. ",
        "pdf": "hittites.pdf",
        "title": "Hittites"
    },
    {
        "description": " Holy Spirit - [PDF] The Person and work of God the Holy Spirit; the indwelling of the Spirit; the filling of the Spirit; the fruit of the Spirit. ",
        "pdf": "HolySpirit.pdf",
        "title": "Holy Spirit"
    },
    {
        "description": " Holy Spirit, Baptism of the - [PDF] The Holy Spirit’s work by which he places each believer into Union with Christ. ",
        "pdf": "HolySpirit_Baptism.pdf",
        "title": "Holy Spirit, Baptism of the"
    },
    {
        "description": " Holy Spirit, Indwelling of the - [PDF] The Holy Spirit indwells the body of the believer at the moment of salvation, 1 Cor 6:19-20, 3:16. ",
        "pdf": "HolySpirit_Indwelling.pdf",
        "title": "Holy Spirit, Indwelling of the"
    },
    {
        "description": " Holy Spirit, Filling of the - [PDF] The empowering ministry brought about by the Holy Spirit's control of the believer's life. ",
        "pdf": "HolySpirit_Filling.pdf",
        "title": "Holy Spirit, Filling of the"
    },
    {
        "description": " Holy Spirit - Salvation Ministry - [PDF] God the Holy Spirit did seven things for each Church Age believer at the time of salvation. ",
        "pdf": "HolySpirit_SalvationMinistry.pdf",
        "title": "Holy Spirit - Salvation Ministry"
    },
    {
        "description": " Holy Spirit - Sustaining Ministry - [PDF] The Holy Spirit sustained Christ during His time on earth, and the Holy Spirit sustains believers in the Christian life. ",
        "pdf": "HolySpirit_SustainingMinistry.pdf",
        "title": "Holy Spirit - Sustaining Ministry"
    },
    {
        "description": "a thorough treatment of what the Bible says about this issue. ",
        "pdf": "Homosexuality.pdf",
        "title": "Homosexuality"
    },
    {
        "description": " Hope - [PDF] The Christian's confidence is much more than just wishful thinking. ",
        "pdf": "Hope.pdf",
        "title": "Hope"
    },
    {
        "description": " Husbands - [PDF] How to be the husband of a happy wife. ",
        "pdf": "Husbands.pdf",
        "title": "Husbands"
    },
    {
        "description": " Iconium - [PDF] Iconium was a city in the southwest part of central Asia Minor located about 95 miles (153 kilometers) from the Mediterranean coast. ",
        "pdf": "Iconium.pdf",
        "title": "Iconium"
    },
    {
        "description": " Idolatry - [PDF] an outline discussion of the various forms of idolatry prevalent in Old Testament and New Testament times. [MAR 2013] ",
        "pdf": "Idolatry.pdf",
        "title": "Idolatry"
    },
    {
        "description": " Imputation - [PDF] How God the Father \"credits\" our sin to Christ and His righteousness to us. ",
        "pdf": "Imputation.pdf",
        "title": "Imputation"
    },
    {
        "description": " Inerrancy - [PDF] A comparison of the views of both sides of the issue of inerrancy in the Bible. ",
        "pdf": "Inerrancy.pdf",
        "title": "Inerrancy"
    },
    {
        "description": " Inheritance - [PDF] A study of the Christian's heritage in Christ. ",
        "pdf": "Inheritance.pdf",
        "title": "Inheritance"
    },
    {
        "description": " Inspiration - [PDF] The verbal, plenary inspiration of the Bible. ",
        "pdf": "Inspiration.pdf",
        "title": "Inspiration"
    },
    {
        "description": "denotes the history of Judaism from the time of the completion of the book of Malachi to the destruction of the temple of Jerusalem (A.D. 70). ",
        "pdf": "intertestamentalperiod.pdf",
        "title": "Intertestamental Period"
    },
    {
        "description": "The Iron Age is the period generally occurring after the Bronze Age, marked by the prevalent use of iron, dates roughly 1300 BC to 700 AD. ",
        "pdf": "iron-age.pdf",
        "title": "Iron Age"
    },
    {
        "description": "An OT patriarch, son of Abraham and father of Jacob and Esau. ",
        "pdf": "Isaac.pdf",
        "title": "Isaac"
    },
    {
        "description": "Of all the prophets of Israel, Isaiah stands out as incomparably the greatest. ",
        "pdf": "Isaiah.pdf",
        "title": "Isaiah"
    },
    {
        "description": " Israel, The Pre-Eminence of - [PDF] Study of the place of the nation of Israel in the Biblical historical framework. ",
        "pdf": "IsraelPreeminence.pdf",
        "title": "Israel, The Pre-Eminence of"
    },
    {
        "description": "Jacob was an OT patriarch, son of Isaac and father of the twelve named ancestors of the tribes of Israel (from International Standard Bible Encyclopedia). ",
        "pdf": "Jacob.pdf",
        "title": "Jacob"
    },
    {
        "description": "from English history, a thorough treatment of Elizabeth I, James I, Edward VI, and Charles I. ",
        "pdf": "James_EarlyStuarts.pdf",
        "title": "James I, King of England, and the Early Stuarts"
    },
    {
        "description": "After the death of James the brother of John, there is frequent mention in the Acts and the Pauline epistles of another James, the brother of the Lord Jesus. ",
        "pdf": "JamesBrotherOfJesus.pdf",
        "title": "James the brother of Jesus"
    },
    {
        "description": "Jealousy is a mental attitude or emotional sin which is characterized by resentment of another person's accomplishments, recognition, attractiveness, or possessions, or by hostility towards someone else who is believed to be enjoying some advantage. ",
        "pdf": "Jealousy.pdf",
        "title": "Jealousy"
    },
    {
        "description": " Jerusalem - [PDF] A study of the chief city of Israel. ",
        "pdf": "Jerusalem.pdf",
        "title": "Jerusalem"
    },
    {
        "description": " Jewish Civilization - [PDF] A holy religion the characteristic of the civilization of the Jews, and their religious feelings were directed to something in the future. All the circumstances of their national life tended to fix their thoughts on One that was to come. ",
        "pdf": "jewishcivilization.pdf",
        "title": "Jewish Civilization"
    },
    {
        "description": "All jurisdiction was either civil, criminal, or ecclesiastical, according as questions of private right, public morality, or religious duty were to be decided. ",
        "pdf": "JewishLaw.pdf",
        "title": "Jewish Law in the 1st Century"
    },
    {
        "description": "a brief outline of ancient Jewish theological literature (Alfred Edersheim). ",
        "pdf": "Jewishliterature.pdf",
        "title": "Jewish Literature"
    },
    {
        "description": " Jewish Religious System - [PDF] A description of each of the main Jewish organizations: the Scribes, the Pharisees, the Sadducees; and the Sanhedrin, and a brief description of the Jewish Talmud. ",
        "pdf": "jewishsystem.pdf",
        "title": "Jewish Religious System"
    },
    {
        "description": "The thirty-nine categories of the Law making up the basis for Sabbath laws regarding work. ",
        "pdf": "JewishTeaching_CategoriesOfWork.pdf",
        "title": "Jewish Teaching, Categories of Work"
    },
    {
        "description": "Jewish teaching regarding the Messiah. ",
        "pdf": "JewishTeaching_Messiah.pdf",
        "title": "Jewish Teaching, Messiah"
    },
    {
        "description": "This article is an outline introduction to the major lines of Jewish theological literature. ",
        "pdf": "JewishTheologicalWritings.pdf",
        "title": "Jewish Theological Writings"
    },
    {
        "description": " Jews and Hellenism - [PDF] The Jews of the Dispersion interacting with Greek thought and culture. ",
        "pdf": "jewsandhellenism.pdf",
        "title": "Jews and Hellenism"
    },
    {
        "description": " Jews Relationship to Gentiles - [PDF] A few examples from extensive Jewish writings of early times of their regulations concerning contact with Gentile people - from Edersheim. ",
        "pdf": "jewsgentiles.pdf",
        "title": "Jews Relationship to Gentiles"
    },
    {
        "description": "a description of the various Jewish parties in the time of Christ, including Pharisees, Sadducees, Hellenists, Arameans. ",
        "pdf": "SectsParties.pdf",
        "title": "Jews, Sects and Parties"
    },
    {
        "description": " John the Baptist - [PDF] -a complete exposition of all of the teaching in the Bible about the great prophet and his relationship to Jesus Christ. ",
        "pdf": "JohnTheBaptist_Outline.pdf",
        "title": "John the Baptist"
    },
    {
        "description": "In all four Gospels the man who steps forth to bury Jesus' body is Joseph of Arimathea. ",
        "pdf": "JosephOfArimathea.pdf",
        "title": "Joseph of Arimathea"
    },
    {
        "description": "Jewish historian and general in the war of the Jews against the Romans in A.D. 66-70. ",
        "pdf": "Josephus.pdf",
        "title": "Josephus"
    },
    {
        "description": "the fiftieth year was to be announced as a Jubilee Year. It possessed the function of an ordinary sabbatic year, thus allowing the land to lie fallow for two successive years. ",
        "pdf": "Jubilee.pdf",
        "title": "Jubilee, Year of"
    },
    {
        "description": "Judaism 101 is an online encyclopedia of Judaism, covering Jewish beliefs, people, places, things, language, scripture, holidays, practices and customs, by Tracey Rich, a Jewish scholar. ",
        "pdf": "JUDAISM101.pdf",
        "title": "Judaism 101"
    },
    {
        "description": " Judea, History of - [PDF] An outline history of the land of Israel from the time of Alexander to Herod the Great; details of the activities of the Hasmonean family (Maccabees); profile of Herod the Great. ",
        "pdf": "Judea.pdf",
        "title": "Judea, History of"
    },
    {
        "description": "from Commentary on the Old Testament - Leviticus, by C. F. Keil and F. Delitzsch. ",
        "pdf": "Judges_Introduction.pdf",
        "title": "Judges, Introduction"
    },
    {
        "description": " Judgment, Justice, and Judging - [PDF] God's Judgment and Justice; a discussion of discernment vs. judgmentalism. ",
        "pdf": "Judgment.pdf",
        "title": "Judgment, Justice, and Judging"
    },
    {
        "description": " Judgment Seat of Christ - [PDF] A brief study of the thrones upon which Christ will sit, in heaven and on earth, after the Church Age. ",
        "pdf": "JudgementSeat.pdf",
        "title": "Judgment Seat of Christ"
    },
    {
        "description": " Justification - [PDF] Outline of the doctrine of Justification. ",
        "pdf": "Justification.pdf",
        "title": "Justification"
    },
    {
        "description": "how the common Greek of the New Testament was formed. ",
        "pdf": "KoineGreek.pdf",
        "title": "Koine Greek, History of"
    },
    {
        "description": "A discussion of how the Law of Moses relates to Church Age doctrine. ",
        "pdf": "LawOfMoses.pdf",
        "title": "Law of Moses"
    },
    {
        "description": " Leaven - [PDF] A study of the concept of leaven in the Bible ",
        "pdf": "Leaven.pdf",
        "title": "Leaven"
    },
    {
        "description": " Legalism - [PDF] The greatest distortion to Grace is religious legalism. ",
        "pdf": "Legalism.pdf",
        "title": "Legalism"
    },
    {
        "description": "A leper suffers from a specific form of mycobacterial infection that was dreaded in antiquity and that until A.D. 1960 was regarded as intractable and incurable. ",
        "pdf": "Leper.pdf",
        "title": "Leper"
    },
    {
        "description": "a study from the Old Testament on how leprosy was identified and treated. An exposition of Leviticus 13 and 14, Commentary on the Old Testament, by C. F. Keil and F. Delitzsch ",
        "pdf": "Leprosy.pdf",
        "title": "Leprosy"
    },
    {
        "description": " Levitical Priesthood - [PDF] A discussion of the institutions of the Jewish religion. ",
        "pdf": "LeviticalPriesthood.pdf",
        "title": "Levitical Priesthood"
    },
    {
        "description": " Levitical Sacrifices and Offerings - [PDF] Descriptions and Christian typology of the Levitical sacrifices and offerings; isagogical support to study of New Testament epistles. ",
        "pdf": "LeviticalSacrifices.pdf",
        "title": "Levitical Sacrifices and Offerings"
    },
    {
        "description": "the Person and Work of Christ, from His presence in eternity past, through His ministry in the feeding of the 5000. ",
        "pdf": "LifeOfChrist.pdf",
        "title": "Life of Christ"
    },
    {
        "description": " Local Church - [PDF] a collection of Bible references dealing with the basic attitude and activities which are present in a local church. ",
        "pdf": "LocalChurch.pdf",
        "title": "Local Church"
    },
    {
        "description": " Locusts - [PDF] Four different types of locusts are mentioned in Joel 4:1. ",
        "pdf": "Locusts.pdf",
        "title": "Locusts"
    },
    {
        "description": " Loyal Love - [PDF] Another look at the subject of AGAPE love. ",
        "pdf": "LoyalLove.pdf",
        "title": "Loyal Love"
    },
    {
        "description": "the city where Peter healed Aeneas. ",
        "pdf": "Lydda.pdf",
        "title": "Lydda"
    },
    {
        "description": "Lydia, being convinced that Jesus was the Messiah, and having made a profession of her faith, was forthwith baptized. ",
        "pdf": "Lydia.pdf",
        "title": "Lydia"
    },
    {
        "description": "the great Jewish warriors struggle against the Greek ruler Antiochus Epiphanes. ",
        "pdf": "MaccabeanRevolt.pdf",
        "title": "Maccabean Revolt"
    },
    {
        "description": "The Jewish family that ruled Judea during most of the 400 silent years. ",
        "pdf": "Maccabees.pdf",
        "title": "Maccabees (Hasmoneans)"
    },
    {
        "description": "the Greek province; home of Alexander the Great. ",
        "pdf": "Macedonia.pdf",
        "title": "Macedonia"
    },
    {
        "description": "The island where Paul was shipwrecked. ",
        "pdf": "malta.pdf",
        "title": "Malta"
    },
    {
        "description": " Manna - [PDF] Manna means \"What is it?\" in the Hebrew. ",
        "pdf": "Manna.pdf",
        "title": "Manna"
    },
    {
        "description": " Marriage, Christian - [PDF] Thorough treatment on the subject of marriage in the Bible. ",
        "pdf": "Marriage.pdf",
        "title": "Marriage, Christian"
    },
    {
        "description": "Luke's narrative now turns to the story of Mary, the mother of our Lord. ",
        "pdf": "MarySong.pdf",
        "title": "Mary's Song"
    },
    {
        "description": "Mastery of the details of life means that you look to the Lord for every detail, that you accept with calm fortitude either the gain or loss of details of life. ",
        "pdf": "MasteryOfTheDetailsOfLife.pdf",
        "title": "Mastery of the Details of Life"
    },
    {
        "description": "An ancient people and land SW of the Caspian Sea, between the Zagros Mountains and the Salt Desert. ",
        "pdf": "Media.pdf",
        "title": "Media and the Medes"
    },
    {
        "description": "a thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "media(rawlinson).pdf",
        "title": "Media - Rawlinson"
    },
    {
        "description": " Mental Attitude - [PDF] A thorough article on the problems of mental attitude and how to grow into stability in the Christian Way of Life; how to have a relaxed mental attitude; how to avoid many kinds of neurosis. ",
        "pdf": "MentalAttitude.pdf",
        "title": "Mental Attitude"
    },
    {
        "description": "from The Life and Times of Jesus the Messiah by Alfred Edersheim, Appendix IX. ",
        "pdf": "Messiah.pdf",
        "title": "Messiah in the Old Testament"
    },
    {
        "description": " Methusaleh - [PDF] The oldest man is the world may also be the most famous. ",
        "pdf": "Methusaleh.pdf",
        "title": "Methusaleh"
    },
    {
        "description": "Paul summoned the Ephesian elders to meet him at the major seaport city of Miletus in order to give them his final charge (Acts 20:15, 21:1). ",
        "pdf": "Miletus.pdf",
        "title": "Miletus"
    },
    {
        "description": "exposition of Exodus 2 (Keil and Delitszch). ",
        "pdf": "MosesEarlyLife.pdf",
        "title": "Moses Early Life"
    },
    {
        "description": "notes from history about Moses and the Pharoahs in Egypt. ",
        "pdf": "MosesEgypt.pdf",
        "title": "Moses in Egypt"
    },
    {
        "description": " Moabites - [PDF] A description of the descendants of Lot, geography, history, religion, relationship to Judges and Ruth. The Moabite Stone. ",
        "pdf": "Moabites.pdf",
        "title": "Moabites"
    },
    {
        "description": " The \"Much More\" Care of God - [PDF] The Lord Jesus did the most for us when He died on the Cross. In the Christian life He does much more than the most for us. ",
        "pdf": "MuchMore.pdf",
        "title": "The \"Much More\" Care of God"
    },
    {
        "description": " Music, Christian - [PDF] What the Bible says about Christian singing; psalms, hymns, spiritual songs; doctrinal content of a few well-known hymns. [AUG 2014] ",
        "pdf": "music.pdf",
        "title": "Music, Christian"
    },
    {
        "description": "The word \"mystery\" in the New Testament refers to the doctrine which is specific for the Church Age. It is called \"the mystery\" because there things were never revealed in Old Testament times. ",
        "pdf": "Mystery.pdf",
        "title": "Mystery Doctrines"
    },
    {
        "description": "notes from the Scofield Reference Bible on the names of Jehovah. ",
        "pdf": "NamesOfGod.pdf",
        "title": "Names of God"
    },
    {
        "description": "The Nazarites were an ancient order of persons consecrated to God by means of a vow. ",
        "pdf": "Nazarites.pdf",
        "title": "Nazarites"
    },
    {
        "description": "King of Babylon (605-562 BC) and conqueror of Jerusalem. ",
        "pdf": "Nebuchadnezzar.pdf",
        "title": "Nebuchadnezzar"
    },
    {
        "description": " Negative Volition - [PDF] Stern warnings to believers \"not to walk as other Gentiles walk\". ",
        "pdf": "NegativeVolition.pdf",
        "title": "Negative Volition"
    },
    {
        "description": "A postexile governor of Judah and writer of the memoirs in the book called by his name. All that is known from contemporary sources about this Jewish patriot is found in the book of Nehemiah. ",
        "pdf": "Nehemiah.pdf",
        "title": "Nehemiah"
    },
    {
        "description": "by Sir William Beechy, a contemporary of the great British hero of the Battle of Trafalgar. ",
        "pdf": "Nelson_Horatio_Biography.pdf",
        "title": "Nelson, Horatio"
    },
    {
        "description": "Nicodemus is a Greek name meaning \"Victor of the People\". ",
        "pdf": "Nicodemus.pdf",
        "title": "Nicodemus"
    },
    {
        "description": "Any Christian believer is either winning or losing in the attempt to live as a Christian. A believer is either living according to the revealed plan of God, or is serving “the ruler of this world.” There is no in-between or middle ground. ",
        "pdf": "NoviceChristian.pdf",
        "title": "Novice Christian"
    },
    {
        "description": " Occupation with Christ - [PDF] the primary focus of the Christian life is the Lord Jesus Christ, and we know Him from the Word of God. ",
        "pdf": "OccupationWithChrist.pdf",
        "title": "Occupation with Christ"
    },
    {
        "description": " Old Age - [PDF] The doctrinal truth behind dying grace. How the last years of your life are the best years. Growing old and gracious at the same time. ",
        "pdf": "OldAge.pdf",
        "title": "Old Age"
    },
    {
        "description": " Old Testament History - [PDF] A history of the period from Solomon to the return of the Jews from exile. ",
        "pdf": "OldTestamentHistory.pdf",
        "title": "Old Testament History"
    },
    {
        "description": "The geographical position of Palestine gave it a political importance greater than that to which its extent and population would otherwise have entitled it. ",
        "pdf": "PalestineProvinces.pdf",
        "title": "Palestine Provinces"
    },
    {
        "description": "A plant and the writing material that was made from it. ",
        "pdf": "Papyrus.pdf",
        "title": "Papyrus"
    },
    {
        "description": "by Pastor Mark Perkins. A thorough study of the parables of Jesus, with expositional notes. ",
        "pdf": "Parables.pdf",
        "title": "Parables"
    },
    {
        "description": "a region of north-eastern Iran, best known for having been the political and cultural base of the rulers of the Parthian Empire. ",
        "pdf": "Parthia.pdf",
        "title": "Parthia"
    },
    {
        "description": "a thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "parthia(rawlinson).pdf",
        "title": "Parthia - Rawlinson"
    },
    {
        "description": "Notes on the Jewish ritual that was the Lord's Supper. ",
        "pdf": "Passover.pdf",
        "title": "Passover"
    },
    {
        "description": " Pastor-Teachers - [PDF] the pastor-teacher has a spiritual gift that he does not deserve and cannot earn. ",
        "pdf": "PastorTeachers.pdf",
        "title": "Pastor-Teachers"
    },
    {
        "description": " Paul and Silas in the Philippian Jail - [PDF] ",
        "pdf": "Paul&Silas_Prison.pdf",
        "title": "Paul and Silas in the Philippian Jail"
    },
    {
        "description": " Paul the Apostle - [PDF] Paul's education and career. [AUG 2014] ",
        "pdf": "paul.pdf",
        "title": "Paul the Apostle"
    },
    {
        "description": "an account from Conybeare and Howson, The Life and Epistles of St. Paul of Paul's ministry in Athens. ",
        "pdf": "PaulInAthens.pdf",
        "title": "Paul in Athens"
    },
    {
        "description": " Paul in Corinth - [PDF] an account of the apostle Paul's ministry in Corinth. ",
        "pdf": "PaulInCorinth.pdf",
        "title": "Paul in Corinth"
    },
    {
        "description": " Paul in Ephesus - [PDF] an account of the apostle Paul's ministry in Ephesus. ",
        "pdf": "PaulInEphesus.pdf",
        "title": "Paul in Ephesus"
    },
    {
        "description": " Paul - First Letter to Corinth - [PDF] narrative surrounding Paul's writing from Ephesus his first epistle to the Corinthians, by Conybeare and Howson, along with their translation of the letters. ",
        "pdf": "Paul_FirstLetterToCorinth.pdf",
        "title": "Paul - First Letter to Corinth"
    },
    {
        "description": "The public life of Paul, from the third year after his conversion to his martyrdom, A.D. 40-64, embraces a quarter of a century, three great missionary campaigns with minor expeditions, five visits to Jerusalem, and at least four years of captivity in Caesarea and Rome. ",
        "pdf": "PaulMissionaryLabors.pdf",
        "title": "Paul - Missionary Labors"
    },
    {
        "description": "narrative surrounding Paul's writing from Macedonia his second epistle to the Corinthians, by Conybeare and Howson, along with their translation of the letter. ",
        "pdf": "Paul_SecondLetterToCorinth.pdf",
        "title": "Paul - Second Letter to Corinth"
    },
    {
        "description": "narrative surrounding Paul's writing from Macedonia his epistle to the Galatians; by Conybeare and Howson, along with their translation of the letter. ",
        "pdf": "Paul_LetterToGalatians.pdf",
        "title": "Paul - Letter to the Galatians"
    },
    {
        "description": "narrative surrounding Paul's writing his epistle to the Romans, from Corinth, prior to his departure for Judea; by Conybeare and Howson, along with their translation of the letter. ",
        "pdf": "Paul_LetterToRomans.pdf",
        "title": "Paul - Letter to the Romans"
    },
    {
        "description": " Paul - to the Thessalonians - [PDF] an account of the events surrounding Paul's writing the two Thessalonian epistles, along with translations by Conybeare and Howson. ",
        "pdf": "Paul_FirstLetterToCorinth.pdf",
        "title": "Paul - to the Thessalonians"
    },
    {
        "description": "His infancy; the Tribe of Benjamin; Social Position of Paul's Family; Paul’s Boyhood. ",
        "pdf": "Paul_totheThessalonians.pdf",
        "title": "Paul's Childhood at Tarsus"
    },
    {
        "description": "His journey to Jerusalem; his education at the school of Gamaliel ",
        "pdf": "pauleducation.pdf",
        "title": "Paul's Education"
    },
    {
        "description": " Paul: Chronological Table - [PDF] A time table of Paul's life, with matching contemporary events. ",
        "pdf": "PaulChronology.pdf",
        "title": "Paul: Chronological Table"
    },
    {
        "description": " Peace of God, and Peace with God - [PDF] How to have peace with God and the peace of God. One of the important stability doctrines and Biblical treatments for depression. ",
        "pdf": "Peace.pdf",
        "title": "Peace of God, and Peace with God"
    },
    {
        "description": "The ascension of Christ to heaven was followed ten days afterwards by the descent of the Holy Spirit upon earth and the birth of the Christian Church. ",
        "pdf": "Pentecost.pdf",
        "title": "Pentecost"
    },
    {
        "description": "Concluding Remarks on the Composition of the Pentateuch, from Commentary on the Old Testament, C. F. Keil and F. Delitzsch. ",
        "pdf": "Pentateuch.pdf",
        "title": "Pentateuch"
    },
    {
        "description": "a description of the life of early believers under Jewish persecution. ",
        "pdf": "PersecutionEarlyChurch.pdf",
        "title": "Persecution in the Early Church"
    },
    {
        "description": "by Philip Schaff, the treatment of Christian believers by Roman authority and citizens. ",
        "pdf": "PersecutionRoman.pdf",
        "title": "Persecution, Roman"
    },
    {
        "description": "an ancient history of the Persian Empire, by George Rawlinson, MA. ",
        "pdf": "persia(rawlinson).pdf",
        "title": "Persia"
    },
    {
        "description": "A disciple of Jesus and apostle of the early Church. ",
        "pdf": "Peter.pdf",
        "title": "Peter, the Apostle"
    },
    {
        "description": "The “deacon” who brought the Gospel to the Samaritans and to the Ethiopian eunuch. ",
        "pdf": "Philip.pdf",
        "title": "Philip the Evangelist"
    },
    {
        "description": "Roman provincial city; important trade center; location of the Philippian church. ",
        "pdf": "Philippi.pdf",
        "title": "Philippi"
    },
    {
        "description": "Phoenicia designates the Syrian coast, and Phoenicians the Northwest Semitic inhabitants of that region in the period from 1200 b.c. to about the end of the Roman era. ",
        "pdf": "Phoenicia.pdf",
        "title": "Phoenicia"
    },
    {
        "description": "a thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "phoenicia(rawlinson).pdf",
        "title": "Phoenicia - Rawlinson"
    },
    {
        "description": "“From This World To That Which Is To Come, Delivered under the similitude of a dream”, BY JOHN BUNYAN ",
        "pdf": "PilgrimsProgress.pdf",
        "title": "Pilgrim's Progress"
    },
    {
        "description": "A concise history of the Church compared with the principles taught in the New Testament. ",
        "pdf": "PilgrimChurch(Broadbent).pdf",
        "title": "Pilgrim Church, The"
    },
    {
        "description": "Pontius Pilate was the fifth governor of the Roman province of Judaea. His rule began in 26 AD and lasted until early in 37 AD. ",
        "pdf": "pilate.pdf",
        "title": "Pilate"
    },
    {
        "description": "The Lord Jesus said \"The poor you will have with you always\" (Mark 14:17), and the Bible has extensive teaching on the subject of poverty and how a Christian's duties include responsibility and care for poor people. ",
        "pdf": "poor.pdf",
        "title": "Poor, The"
    },
    {
        "description": " Prayer - [PDF] Practical teaching on how to pray to God and what to expect from Him. ",
        "pdf": "Prayer.pdf",
        "title": "Prayer"
    },
    {
        "description": " Prayer, Principles of- [PDF] prayer is communication with God. ",
        "pdf": "PrayerPrinciples.pdf",
        "title": "Prayer, Principles of"
    },
    {
        "description": " Preaching, Doctrine of - [PDF] Word study beginning in Titus 1:3 - KEIRUGMA; the true practice of Bible presentation. ",
        "pdf": "Preaching.pdf",
        "title": "Preaching, Doctrine of"
    },
    {
        "description": " Predestination - [PDF] How the word \"predestination\" is used in the Bible. ",
        "pdf": "Predestination.pdf",
        "title": "Predestination"
    },
    {
        "description": " Pride (Arrogance) - [PDF] Whenever a Christian fails to execute the plan of God for his life, sinful pride is the primary reason and motivating cause. ",
        "pdf": "Pride.pdf",
        "title": "Pride (Arrogance)"
    },
    {
        "description": "Among the most interesting glimpses of early life in the church is that afforded by a small piece of rapidly-drawn scenery which presents to our view 'a great company of the priests,' 'obedient to the faith' (Acts 6:7). ",
        "pdf": "Priesthood.pdf",
        "title": "Priesthood, The Officiating"
    },
    {
        "description": "Privacy is that principle of freedom whereby an individual has the right to retire from the company of others, remaining in seclusion from the knowledge or observation of others. ",
        "pdf": "Privacy.pdf",
        "title": "Privacy"
    },
    {
        "description": " Promotion - [PDF] Personal advancement in the Bible; if God does not promote you, you're not promoted! ",
        "pdf": "Promotion.pdf",
        "title": "Promotion"
    },
    {
        "description": " Prophets and Prophesying - [PDF] An outline study of the Old Testament Prophet and his ministry. ",
        "pdf": "Prophets.pdf",
        "title": "Prophets and Prophesying"
    },
    {
        "description": "an outline description of the historical books of the Bible, Joshua, Judges, 1 and 2 Samuel, and 1 and 2 Kings. ",
        "pdf": "PropheticalHistory.pdf",
        "title": "Prophetical History of the Old Testament"
    },
    {
        "description": " Propitiation - [PDF] Jesus Christ is our Mercy Seat, our place of propitiation! ",
        "pdf": "Propitiation.pdf",
        "title": "Propitiation"
    },
    {
        "description": " Psalms, Introduction to - [PDF] An introduction to the study of the Psalms, and an outline of the First Psalm. ",
        "pdf": "PsalmsIntro.pdf",
        "title": "Psalms, Introduction to"
    },
    {
        "description": " Purity in the Christian Life - [PDF] The apostle Paul told Timothy, \"Keep yourself pure...\" Good advice for all of us. A study of KATHAROS. ",
        "pdf": "Purity.pdf",
        "title": "Purity in the Christian Life"
    },
    {
        "description": " Puteoli - [PDF] A maritime city of Campania in Italy where Paul landed on his voyage to Rome; the modern name is Pozzuoli. [AUG 2014] ",
        "pdf": "puteoli.pdf",
        "title": "Puteoli"
    },
    {
        "description": "brief biography of the Greek mathematician, Born: about 569 BC in Samos, Ionia. ",
        "pdf": "Pythagoras.pdf",
        "title": "Pythagoras"
    },
    {
        "description": "an exposition of Titus 1:5-9. ",
        "pdf": "QualificationsForMinisters.pdf",
        "title": "Qualifications for Ministers"
    },
    {
        "description": " Rabbinical Exegesis - [PDF] -from Talmud scholars, a brief description of the rules to be observed in deducing Halakhah (Jewish law) from the texts of Scripture. ",
        "pdf": "RabbinicalExegesis.pdf",
        "title": "Rabbinical Exegesis"
    },
    {
        "description": "Until the formation of the later Rabbinical colleges, which flourished after the Jews were driven from Jerusalem, the instruction in the divinity schools seems to have been chiefly oral. ",
        "pdf": "rabbinicalschools.pdf",
        "title": "Rabbinical Schools"
    },
    {
        "description": " Rahab and the Grace of God - [PDF] Rahab, Salmon's wife, Ruth's mother-in-law, David's great-great-grandmother, a trophy to the Grace of God. ",
        "pdf": "Rahab.pdf",
        "title": "Rahab and the Grace of God"
    },
    {
        "description": " Rapture, The - [PDF] A description of the carrying away of believers at the end of the Church Age; a comparison between Rapture and Second Coming events. ",
        "pdf": "Rapture.pdf",
        "title": "Rapture, The"
    },
    {
        "description": " Reconciliation - [PDF] How God the Father changes (reconciles) us to His own standards and righteousness. ",
        "pdf": "Reconciliation.pdf",
        "title": "Reconciliation"
    },
    {
        "description": "When a person became ceremonially unclean by some contact with an unclean animal or person or by contact with a dead person, he was required to go through a ritual cleansing. comprehensive study of the doctrine showing how the Lord deals with recalcitrant and implacable Christians. ",
        "pdf": "RedHeiferOffering.pdf",
        "title": "Red Heifer Offering"
    },
    {
        "description": " Redeeming the Time - [PDF] A Christian is obliged to make the most of time here on earth, living with eternity's values in view. ",
        "pdf": "RedeemingTime.pdf",
        "title": "Redeeming the Time"
    },
    {
        "description": " Redemption - [PDF] A study of the doctrine of redemption, God's special intervention for the salvation of mankind. ",
        "pdf": "Redemption.pdf",
        "title": "Redemption"
    },
    {
        "description": " Refreshment - [PDF] Romans 15:32 says, \"So that by God's will I may come to you with joy and together with you be refreshed.\" ",
        "pdf": "Refreshment.pdf",
        "title": "Refreshment"
    },
    {
        "description": " Regeneration - [PDF] What does it mean to be born again? A discussion of the words referring to a believer's new life in Christ. ",
        "pdf": "Regeneration.pdf",
        "title": "Regeneration"
    },
    {
        "description": " Religions of the World - [PDF] Brief descriptions of the major non-Christian religions of the world, including Hinduism, Islam, Buddhism, Jainism, Shinto, Zoroastrianism, Taoism, and Confucianism. ",
        "pdf": "Religions.pdf",
        "title": "Religions of the World"
    },
    {
        "description": "\"Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and you shall receive the gift of the Holy Spirit.\" ",
        "pdf": "repentance.pdf",
        "title": "Repentance"
    },
    {
        "description": "The present responsibilities of those who wait for the Kingdom of Christ. ",
        "pdf": "Responsibility.pdf",
        "title": "Responsibility"
    },
    {
        "description": "After the Second Advent of Christ, He will assemble and restore Israel. ",
        "pdf": "Restoration.pdf",
        "title": "Restoration of the Jews"
    },
    {
        "description": " Resurrection of Christ - [PDF] An outline study of the main features of the resurrection of Christ, including a description of the resurrection body of Christ and the events surrounding the resurrection. ",
        "pdf": "Resurrection.pdf",
        "title": "Resurrection of Christ"
    },
    {
        "description": "a comprehensive study of the doctrine showing how the Lord deals with recalcitrant and implacable Christians. ",
        "pdf": "Reversionism.pdf",
        "title": "Reversionism"
    },
    {
        "description": "A city on the east side of the Sicilian Straits, the modern Reggio di Calabria, where Paul’s ship stopped on the way to Rome. ",
        "pdf": "rhegium.pdf",
        "title": "Rhegium"
    },
    {
        "description": "The capital city of Rhodes is mentioned in Acts 21:1 as one of Paul's stopping places on his final journey to Jerusalem. Though the port city had once been one of the most powerful commercial centers of the Mediterranean, by the time of Paul's visit it was little more than a beautiful city with a glorious past. ",
        "pdf": "Rhodes.pdf",
        "title": "Rhodes"
    },
    {
        "description": "a description of the roads Paul probably traveled from Jerusalem to Damascus. ",
        "pdf": "Roads_JerusalemToDamascus.pdf",
        "title": "Roads - Jerusalem to Damascus"
    },
    {
        "description": "Scriptures referring to Jesus Christ as the Rock. ",
        "pdf": "ChristTheRock.pdf",
        "title": "Rock, Jesus Christ the Rock"
    },
    {
        "description": "from Vegetius, Epitome of Military Science. ",
        "pdf": "RomanArmy_SoldierTraining.pdf",
        "title": "Roman Army, Soldier Training"
    },
    {
        "description": "Great development had been given to commerce by the consolidation of the Roman Empire. ",
        "pdf": "roman-commerce.pdf",
        "title": "Roman Commerce"
    },
    {
        "description": " Roman History - [PDF] An outline history of the period of time leading up to the birth of Christ; The Republic, the Punic Wars, the rise of the Caesars; the city of Rome in New Testament times; the Catacombs. ",
        "pdf": "RomanHistory.pdf",
        "title": "Roman History"
    },
    {
        "description": "a list of the men who ruled Rome from its founding in 754 BC until the beginning of the Roman Republic. ",
        "pdf": "RomanKings.pdf",
        "title": "Roman Kings"
    },
    {
        "description": "The source of Roman law is the family or gens. The proprietary rights of the pater familias as head of this primitive unit of organization are fundamental in private law, and the scope of the criminal jurisdiction of the state was limited by the power of life and death exercised by the head of the family over those under his authority. ",
        "pdf": "RomanLaw.pdf",
        "title": "Roman Law"
    },
    {
        "description": " Roman Names - The names of Roman citizens had four parts. Paul's Roman name was Saulus Benjaminus Tarsus Paulus. ",
        "pdf": "",
        "title": "Roman Names"
    },
    {
        "description": "an extended account of the persecution of Christians by the Romans, and details of the siege and destruction of Jerusalem in 70 AD. ",
        "pdf": "RomanPersecution.pdf",
        "title": "Roman Persecution"
    },
    {
        "description": "from the time when Augustus united the world under his own power, the provinces were divided into two different classes. ",
        "pdf": "RomanProvincialSystem.pdf",
        "title": "Roman Provincial System"
    },
    {
        "description": "translation of Romans by C&H, extensive comments and footnotes. ",
        "pdf": "Romans_Conybeare&Howson.pdf",
        "title": "Romans - Conybeare and Howson"
    },
    {
        "description": " Rome in BibleTimes - [PDF] -what was the city of Rome like in the times of the early church? ",
        "pdf": "RomeInBibleTimes.pdf",
        "title": "Rome in BibleTimes"
    },
    {
        "description": "description of Paul's journey to Rome and his sojourn there, places and events.. ",
        "pdf": "Rome_PaulsJourney.pdf",
        "title": "Rome, Paul's Journey to"
    },
    {
        "description": "The importance of the Sabbath in Jewish life is stressed from the story of Creation in Genesis, to the Ten Commandments, which state that people are to refrain from labor on the 7th day. ",
        "pdf": "JewishTeaching_Sabbath.pdf",
        "title": "Sabbath, Jewish Teaching"
    },
    {
        "description": "The first of the revelations of God to the people of Israel related to the sacrifices, in which the Israelites were to draw near to Him, that they might become partakers of His grace. ",
        "pdf": "Sacrifices.pdf",
        "title": "Sacrifices in the Old Testament"
    },
    {
        "description": "brief article describing this sect. ",
        "pdf": "Sadducees.pdf",
        "title": "Sadducees"
    },
    {
        "description": "the city on Cyprus, visited by Paul and Barnabus. Traditional place where Barnabas, a native of Cyprus, was martyred. ",
        "pdf": "Salamis.pdf",
        "title": "Salamis"
    },
    {
        "description": " Salvation Doctrines - [PDF] Teaching about our union with Christ; and a listing, with verses, of more than 50 basic doctrines of the Bible which describe all that happens to a believer at the moment of salvation. ",
        "pdf": "SalvationDoctrines.pdf",
        "title": "Salvation Doctrines"
    },
    {
        "description": " Salvation in the Old Testament - [PDF] How people got saved before the death of Christ on the Cross. ",
        "pdf": "SalvationOT.pdf",
        "title": "Salvation in the Old Testament"
    },
    {
        "description": "a brief but thorough political history of Samaria. ",
        "pdf": "Samaria.pdf",
        "title": "Samaria"
    },
    {
        "description": "exposition of John 4:1-42; Christ's dealings with a troubled woman. ",
        "pdf": "SamaritanWoman.pdf",
        "title": "Samaritan Woman"
    },
    {
        "description": "When Paul \"touched\" here after passing Chios on returning from his third missionary journey (Acts 20:15), Samos was a \"free city\" in the province of Asia. ",
        "pdf": "Samos.pdf",
        "title": "Samos"
    },
    {
        "description": "From Commentary on the Old Testament, Leviticus 13 to 16, by C. F. Keil and F. Delitzsch. ",
        "pdf": "Samson.pdf",
        "title": "Samson"
    },
    {
        "description": "Introduction to the books of Samuel, from Commentary on the Old Testament, by C. F. Keil and F. Delitzsch ",
        "pdf": "Samuel_Introduction.pdf",
        "title": "Samuel, Introduction"
    },
    {
        "description": "a brief description and history of this ruling Jewish organization. ",
        "pdf": "Sanhedrin.pdf",
        "title": "Sanhedrin"
    },
    {
        "description": "The New Persians. A thoroughly researched study by George Rawlinson, from The Seven Great Monarchies of the Ancient Eastern World. ",
        "pdf": "sassanians(rawlinson).pdf",
        "title": "Sassanians - Rawlinson"
    },
    {
        "description": " Satan - [PDF] What the Bible says about Satan and his strategies. ",
        "pdf": "Satan.pdf",
        "title": "Satan"
    },
    {
        "description": " Saul - [PDF] The son of Kish of the tribe of Benjamin, the first king of Israel. [FEB 13] ",
        "pdf": "Saul.pdf",
        "title": "Saul"
    },
    {
        "description": " Second Advent of Christ - [PDF] ",
        "pdf": "SecondAdvent.pdf",
        "title": "Second Advent of Christ"
    },
    {
        "description": "by Paton James Gloag, minister of the Parish of Dunning, Blantyre and Galashiels, early 20th century. \"The greatest care and caution are necessary in examining the evidences of our conversion. We ought to exercise a holy jealousy over ourselves, and to avoid arriving at any definite conclusion as to the safety of our condition, except on sure and scriptural grounds.\" ",
        "pdf": "SelfDeception.pdf",
        "title": "Self Deception"
    },
    {
        "description": "King of Assyria and Babylonia (705-681 B.C.), son of Sargon II and father of Esarhaddon. He besieged Jerusalem in the days of Hezekiah. ",
        "pdf": "Sennacherib.pdf",
        "title": "Sennacherib"
    },
    {
        "description": " Separation - [PDF] A Christian lives in the world, but is not \"of\" it. ",
        "pdf": "Separation.pdf",
        "title": "Separation"
    },
    {
        "description": "Septuagint (sometimes abbreviated LXX) is the name given to the Greek translation of the Jewish Scriptures. ",
        "pdf": "Septuagint.pdf",
        "title": "Septuagint"
    },
    {
        "description": "the Roman official whom Paul and Barnabas met in Cyprus on their first missionary journey. ",
        "pdf": "SergiusPaulus.pdf",
        "title": "Sergius Paulus"
    },
    {
        "description": " Servants and Slaves - [PDF] A description of the condition and treatment of servants and slaves in Bible times. ",
        "pdf": "ServantsSlaves.pdf",
        "title": "Servants and Slaves"
    },
    {
        "description": " Servants of God - [PDF] God commands Christians to be faithful and obedient servants. ",
        "pdf": "Servants.pdf",
        "title": "Servants of God"
    },
    {
        "description": "history of the first twelve Emperors of the Roman Empire. ",
        "pdf": "Seutonius_TwelveCaesars.pdf",
        "title": "Seutonius - the Twelve Caesars"
    },
    {
        "description": " Sexual Health in the Bible - [PDF] Extensive study of what the Bible says about non-marital sexual activity. ",
        "pdf": "SexualHealth.pdf",
        "title": "Sexual Health in the Bible"
    },
    {
        "description": " Shepherds of the Flock of God - [PDF] the qualifications and duties of spiritual shepherds; Jehovah as Shepherd; Jesus Christ as the Good Shepherd. ",
        "pdf": "Shepherds.pdf",
        "title": "Shepherds of the Flock of God"
    },
    {
        "description": " Ships and Navigation - [PDF] the ships and navigation techniques of ancient times, especially relating to the voyages of Paul. [AUG 2014] ",
        "pdf": "ships-and-navigation.pdf",
        "title": "Ships and Navigation"
    },
    {
        "description": " Sidon - [PDF] A city-state on the Mediterranean coast, 40 km (25 mi) N of Tyre, the modern city of Ṣaidaʾ. [AUG 2014] ",
        "pdf": "sidon.pdf",
        "title": "Sidon"
    },
    {
        "description": " Sin, Doctrine of - [PDF] a comprehensive topic study of the Doctrine of Sin. ",
        "pdf": "Sin.pdf",
        "title": "Sin, Doctrine of"
    },
    {
        "description": "the Greek words for all the sins mentioned in the New Testament. ",
        "pdf": "SIN_GreekWords.pdf",
        "title": "Sin, Greek Words"
    },
    {
        "description": "Sin Nature: part of the essence of the soul acquired at Adam's fall and passed on to every person at birth. ",
        "pdf": "SinNature.pdf",
        "title": "Sin Nature"
    },
    {
        "description": "The final stage of divine discipline - with examples. ",
        "pdf": "SINUNTODEATH.pdf",
        "title": "Sin Unto Death"
    },
    {
        "description": "One of the worst sins; how to recognize it; how to have victory! ",
        "pdf": "SinsOfTheTongue.pdf",
        "title": "Sins of the Tongue"
    },
    {
        "description": "Son of David and third king of Israel. ",
        "pdf": "Solomon.pdf",
        "title": "Solomon"
    },
    {
        "description": "Man is aware of his own existence and is able to relate to both animate and inanimate life on earth. ",
        "pdf": "Soul.pdf",
        "title": "Soul, The Human"
    },
    {
        "description": "an excellent study of the first martyr! ",
        "pdf": "Stephen.pdf",
        "title": "Stephen"
    },
    {
        "description": "the divine power which is given to each Christian at the time of salvation. ",
        "pdf": "HolySpirit_SpiritualGifts.pdf",
        "title": "Spiritual Gifts"
    },
    {
        "description": "The advanced Christian, the person who has \"attained to the unity of the faith, and of the knowledge of the Son of God, to a mature man, to the measure of the stature which belongs to the fullness of Christ,\" has completed basic preparation, is standing firm, and is ready to be promoted into mature production in the Lord. ",
        "pdf": "Standing.pdf",
        "title": "Standing"
    },
    {
        "description": "the only direct reference to the Stoics in the Bible occurs in Acts 17:18, where Paul is reported to have addressed Epicurean and Stoic philosophers in Athens. ",
        "pdf": "Stoicism.pdf",
        "title": "Stoicism"
    },
    {
        "description": " Substitution - [PDF] The unlimited substitutionary atonement for sin. Christ bore our sins in His own body... ",
        "pdf": "Substitution.pdf",
        "title": "Substitution"
    },
    {
        "description": " Suffering - [PDF] A discussion of the suffering experienced by believers and unbelievers; deserved and undeserved suffering; how to avoid some forms of suffering; suffering for blessing. ",
        "pdf": "Suffering.pdf",
        "title": "Suffering"
    },
    {
        "description": "a discussion of the makeup and organization of synagogues in the times of the early church; from Sketches of Jewish Social Life, by Alfred Edersheim, Chapters 16 and 17; also from Conybeare and Howson, The Life and Epistles of St. Paul. ",
        "pdf": "Synagogues.pdf",
        "title": "Synagogues"
    },
    {
        "description": "A city on the east coast of Sicily, about midway between Catania and the southeastern extremity of the island; Paul stopped there three days on his voyage from Malta to Rome (Acts 28:12). ",
        "pdf": "syracuse.pdf",
        "title": "Syracuse"
    },
    {
        "description": " Tabernacle Furniture - [PDF] A description of function and typology of the laver, candlesticks, table of bread, altar of incense, veil, and ark of the covenant. ",
        "pdf": "TabernacleFurniture.pdf",
        "title": "Tabernacle Furniture"
    },
    {
        "description": "How can Israelites on the Sabbath move about from one private domain to another? By use of an eruv, symbolic food that legally commingles privately owned domains. ",
        "pdf": "Talmud_Eruvin.pdf",
        "title": "Talmud: Eruvin"
    },
    {
        "description": "what the Talmud teaches about Jesus Christ, the founder of Christianity; and about his followers, the Christians. ",
        "pdf": "Talmud_OnChrist.pdf",
        "title": "Talmud: On Christ"
    },
    {
        "description": "The name \"Talmud\" means \"teaching\" or \"study\" and refers to the oral law which has been taught to the children of Israel since the time of Moses. ",
        "pdf": "talmudhistory.pdf",
        "title": "Talmud, Origins"
    },
    {
        "description": " Talmud, Organization - [PDF] -The rabbis of the 2nd and 3rd centuries after Christ organized the Talmud in the form we find it today. ",
        "pdf": "Talmud_Organization.pdf",
        "title": "Talmud, Organization"
    },
    {
        "description": "the portion of the Talmud dealing with Sabbath categories of work. (Order Moed, Tractate Shabbath, Chapter 7) ",
        "pdf": "Talmud_TractateShabbath.pdf",
        "title": "Talmud, Tractate Shabbath"
    },
    {
        "description": "The rabbis of the 2nd and 3rd centuries after Christ organized the Talmud in the form we find it today. ",
        "pdf": "Talmud_Structure.pdf",
        "title": "Talmud, Structure of"
    },
    {
        "description": "A study of the mission of the local church with respect to \"feeding the flock\". ",
        "pdf": "TeachingInLocalChurch.pdf",
        "title": "Teaching in the Local Church"
    },
    {
        "description": "from Edersheim, Alfred, \"Sketches of Jewish Social Life\", Appendix I. ",
        "pdf": "TempleMeasurement.pdf",
        "title": "Temple: Description and Measurements"
    },
    {
        "description": " Theology of Biblical Criticism - [PDF] [MAR 2013] ",
        "pdf": "TheologyBiblicalCriticism.pdf",
        "title": "Theology of Biblical Criticism"
    },
    {
        "description": "the second city in Europe to hear the preaching voice of St. Paul, and probably the first church to receive an epistle from him.. ",
        "pdf": "thessalonica.pdf",
        "title": "Thessalonica"
    },
    {
        "description": "location of one of the seven local churches of Revelation; home of Lydia, the seller of purple. ",
        "pdf": "Thyatira.pdf",
        "title": "Thyatira"
    },
    {
        "description": "Thorns are associated with the curse of mankind and nature at the time of the Fall. Man has to contend with thorns in his work and in his spiritual life. ",
        "pdf": "thorns.pdf",
        "title": "Thorns"
    },
    {
        "description": "a brief biography of Paul's companion. ",
        "pdf": "Timothy.pdf",
        "title": "Timothy"
    },
    {
        "description": "this PDF file has the book of Titus in three parallel columns; this allows for comparing these three versions while you are studying. ",
        "pdf": "TITUS_KJV-NAS-NIV.pdf",
        "title": "Titus in Three Versions (KJV, NASB, and NIV)"
    },
    {
        "description": "In its most limited sense, \"Torah\" refers to the Five Books of Moses: Genesis, Exodus, Leviticus, Numbers and Deuteronomy. But the word \"torah\" can also be used to refer to the entire Jewish bible (the body of scripture known to non-Jews as the Old Testament and to Jews as the Tanakh or Written Torah), or in its broadest sense, to the whole body of Jewish law and teachings. ",
        "pdf": "JewishTeaching_Torah.pdf",
        "title": "Torah, Jewish Teachings on"
    },
    {
        "description": "Its Origin, Character, and Literature, the Mishnah And Talmud - from Alfred Edersheim, \"The Life and Times of Jesus the Messiah\" ",
        "pdf": "traditionalism.pdf",
        "title": "Traditionalism"
    },
    {
        "description": "The doctrine of the trinity recognizes God as being one in essence but three persons who possess equal, perfect, eternal and infinite identical essence. ",
        "pdf": "Trinity.pdf",
        "title": "Trinity"
    },
    {
        "description": "On the second missionary journey, Paul and Silas came to Troas after being forbidden to preach the Word of God in Asia (Acts 16:6). ",
        "pdf": "Troas.pdf",
        "title": "Troas"
    },
    {
        "description": " Truth - [PDF] The Word of God is Truth; examples of eagerness for God's truth. ",
        "pdf": "Truth.pdf",
        "title": "Truth"
    },
    {
        "description": "brief biographies of the first twelve emperors of the Roman Empire, by Seutonius. ",
        "pdf": "TwelveCaesars(Seutonius).pdf",
        "title": "Twelve Caesars"
    },
    {
        "description": "\"All these are the twelve tribes of Israel, and this is what their father said to them when he blessed them. He blessed them, every one with the blessing appropriate to him.\" (Gen. 49:28). ",
        "pdf": "TwelveTribes.pdf",
        "title": "Twelve Tribes of Israel"
    },
    {
        "description": "When Paul and Barnabas traveled from Antioch to Jerusalem, they went through Phoenicia to tell the believers how God had brought Gentiles to faith (Acts 15:3). ",
        "pdf": "Tyre.pdf",
        "title": "Tyre"
    },
    {
        "description": " Uncleanness in the Levitical System - [PDF] Notes on the concept of ceremonial uncleanness in the Old Testament Jewish system. ",
        "pdf": "Uncleanness.pdf",
        "title": "Uncleanness in the Levitical System"
    },
    {
        "description": " Union (davaq) - [PDF] a study of the Hebrew word DAVAQ, \"union\". ",
        "pdf": "UnionDAVAQ.pdf",
        "title": "Union (davaq)"
    },
    {
        "description": " Union with Christ (Positional Truth) - [PDF] Teaching related to all of the benefits and responsibilities of being \"in Christ\". ",
        "pdf": "UnionWithChrist.pdf",
        "title": "Union with Christ (Positional Truth)"
    },
    {
        "description": "a brief description of Abraham's birthplace ",
        "pdf": "Ur.pdf",
        "title": "Ur of the Chaldees"
    },
    {
        "description": " Walk, The Christian - [PDF] The Christian Walk; obedience to the command to \"walk worthy of the calling wherewith you are called\". [AUG 2014] ",
        "pdf": "walking.pdf",
        "title": "Walk, The Christian"
    },
    {
        "description": "an essay on Christian giving and support of Christian work, based on the Bible narrative of this story. ",
        "pdf": "WidowsMite.pdf",
        "title": "Widow's Mite"
    },
    {
        "description": "In the New Testament, a widow is a woman who has lost her husband by death or is divorced from her husband. ",
        "pdf": "Widows.pdf",
        "title": "Widows"
    },
    {
        "description": "from a discussion of Ephesians 6:15, \"And your feet shod with the preparation of the gospel of peace.\" ",
        "pdf": "Witnessing.pdf",
        "title": "Witnessing"
    },
    {
        "description": "The mental attitude sin of worry, its cause and cure. ",
        "pdf": "Worry.pdf",
        "title": "Worry, the Sin of"
    },
    {
        "description": " Workers, Qualifications for Christian - [PDF] A list of qualifications for every type of Christian worker, from personal worker to missionary to pastors and teachers. ",
        "pdf": "WorkerQuals.pdf",
        "title": "Workers, Qualifications for Christian"
    },
    {
        "description": " Zacharias Presenting Incense in the Temple - [PDF] A description of the duties of the priest who was chosen by lot each day to perform the burning of incense in the Holy Place, as Zacharias did in Luke 1:5-25. ",
        "pdf": "Zacharias.pdf",
        "title": "Zacharias Presenting Incense in the Temple"
    },
    {
        "description": "the praise and prayer of Zacharias when his son, John the Baptist, was born. ",
        "pdf": "ZachariasProphecy.pdf",
        "title": "Zacharias' Prophecy"
    },
    {
        "description": " one page study giving the Bible references and definitions for Zion, a word that means \"grace.\" ",
        "pdf": "Zion.pdf",
        "title": "Zion"
    }
]
